#include"Pl.h"
/*Завдання #1 
Створіть клас для підрахунку площі геометричних фігур. 
Клас повинен надавати функціональність для підрахунку площі трикутника за різними формулами, 
площі прямокутника, площі квадрата, площі ромба. 
Функції-члени для підрахунку площі повинні бути реалізовані за допомогою статичних функцій-членів. 
Також клас повинен читати кількість підрахунків площі і 
повертати це значення за допомогою статичної функції-члена.*/
int main()
{   
	cout<<Pl::PlTr1(34, 23)<<'\n';//по двом катетам(прямокутний трикутник)
	cout<<Pl::PlTr2(12,15)<<'\n';//по площі і основі
	cout<<Pl::pov_k() << '\n';
	cout << Pl::PlTr3(4.9, 7, 11.3) << '\n';
	cout << Pl::Pram(4, 8) << '\n';
	cout << Pl::Kv(78) << '\n';
	cout << Pl::Ro(34, 76) << '\n';//площа ромба по двом діаг.
	cout << Pl::pov_k() << '\n';
}